[
  {
    "path": "posts/2021-06-20-dataviz2/",
    "title": "Data Viz Makeover 2",
    "description": "A critque and makeover of a Singapore trade data visualisation.",
    "author": [
      {
        "name": "Arnold Ng",
        "url": {}
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Critique of the visualisation\r\n1.1 Clarity\r\n1.2 Aesthetics\r\n\r\n2. Proposed alternative visualisation\r\n3. Step-by-step guide on preparing data visualisation in Tableau\r\n3.1 Data preparation in Excel\r\n3.2 Visualisation in Tableau\r\n\r\n4. New Visualisation and Observations\r\n\r\n1. Critique of the visualisation\r\n\r\nFig 1. Original data visualisation\r\n1.1 Clarity\r\nThe intent of the visualisation is to describe some of Singapore’s most important mechandise trade relationships. It shows which countries are net exporters to Singapore and which are net importers, and also informs the reader of the\r\nColor coding used for two dimensions - export vs import, and country/region. This makes it confusing for the reader as there is too much color in the visualisation. In order to direct the readers attention appropriately, one visualisation detail (e.g. size, colour, axes) should be used for one data dimension only.\r\n\r\nFig 2. Size does not scale linearly with total merchandise trade volume\r\nThe scaling of the bubble size is not based on area (see Fig 2 above). Instead, it is the radius which is proportional to the total bilateral trade volume. This makes the size scale polynomially (i.e. the square of the total bilateral trade volume)instead of linearly which can give rise to misinterpretation as the reader usually assumes that the size will scale linearly.\r\nThe bubbles are opaque, obscuring the data points showing the export/import amounts of some countries. This makes it difficult to see exactly how much Singapore imports/exports to these countries. The data labels only quote the total bilateral merchandise trade volume, from which the reader cannot derive the import/export figures.\r\nThe axes labels at clustered around the origin rather than centred on the axes. This makes it difficult for the reader to tell at a glance which axis refers to exports and which to imports. The visualisation attempts to use colours to differentiate the axes, but it is not as effective as using title positioning.\r\n\r\nFig 3. Annotation from original viz\r\nThe graphic does not help to convey to the reader the key message annotated in the blue box (see Fig 3 above). The key message in the blue box discusses Singapore’s overall balance of trade with the two largest economies in the world, Mainland China and the United States. It references trade data going back to 2006. However, the data in the visualisation only shows data for 2020.\r\nThe annotation does note use similar time scales in comparing the two countries. It compares trade with China dating back to 2009, but for the United States it uses trade data going back to 2006.\r\nThe visualisation designates a top net exporter and top net importer but does not explain what this means to the reader. It appears from inspection that this refers to the country with which Singapore has the highest and lowest balance of trade.\r\n1.2 Aesthetics\r\nBesides clarity the aesthetics of the visualisation could also be improved. Some observed weaknesses are:\r\nUse of large labels within opaque boxes creates a very cluttered impression. There is too much going on on the visualisation, with many boxes and icons scattered across the visualisation with very little explanatory value. For example, the data labels would be better served being inside the respective circles rather than sticking out from the circles to keep the rest of the graph clean.\r\n\r\nFig 4. Unnecessary icons\r\nUnnecessary use of large icons clutters visualisation with non-data ink.  The icons (e.g. ‘Imports’/‘Exports’ and ‘Top Importer’/‘Top Exporter’) are unnecessary. For the ‘Imports’/‘Exports’ axes labels, the text would have been sufficient.\r\nThere is too much colour in the visualisation. Even the background is blue even though color coding is a key detail used to convey information in this visualisation. The clash of colours is very irritating to the reader as it takes attention away from the key points the visualisation is trying to make.\r\n2. Proposed alternative visualisation\r\nThe proposed visualisation will address the issues raised above.\r\nAn interactive side-by-side comparison of trade data from selected years will help readers to compare change in trade data over time. This will help users to draw conclusions on any change in the nature of our trade relationships (e.g. change from net exporter to net importer or vice versa) as well as the relative importance of our various trade relationships when compared with one another.\r\nColor coding on the bubble chart will only be used for countries. This will help to direct the users attention appropriately to changes in our relationships with various countries/regions relative to each other.\r\nAxes are labeled in the middle of the axis for clarity.\r\nBubble size scales linearly, with the area corresponding to the relative volume of bilateral trade with respective country.\r\nReduce opacity of bubble fills so that all data points can be clearly visible.\r\nTotal Bilateral Trade is plotted separately as a supplementary chart. This will allow the reader to quickly see how our trade relationships are ranked year to year and identify trends (e.g. are some countries/regions becoming more/less important over time).\r\nBalance of trade is plotted separately as a supplementary chart. This does away with the need to identify ‘Top net exporter’ or ‘Top net importer’ with icons as the balance of trade plot will show the relative ranking of the various countries over time. We can also see trends in our trade relationships over time (E.g. some relationships evolving from net exporter to net importer and vice versa).\r\nLink all charts so that when a country is selected, it will be highlighted across all charts for attention. This will allow the reader to zoom into the relevant country and make comparisons.\r\nCustom tooltips to highlight key information more clearly.\r\n\r\nSketch of proposed data visualisation\r\n3. Step-by-step guide on preparing data visualisation in Tableau\r\n3.1 Data preparation in Excel\r\nAs the dataset used is the same as Data Viz Makeover 1, we follow the same steps noted in Data Viz Makeover 1 to prepare the data.\r\n3.2 Visualisation in Tableau\r\nOnce the data has been prepared, we now move to Tableau to execute the proposed visualisation.\r\nStep\r\nActions Required\r\nScreenshot\r\n1\r\nFirst, load the processed data into Tableau and join the Import and Export tables. We should use a full outer join as there will be cases where a country has registered exports but no registered imports for the given time period and vice versa. Any other form of join (e.g. left outer, right outer, inner) will result in loss of data. The data should be joined on Country/Region and Date\r\n\r\n2\r\nNext, create calculated fields to consolidate the data for Country/Region and Date as these fields will be nil for some rows if we only look at Imports or Exports. We can do this using an IFNULL statement.\r\n\r\n3\r\nNow create a calculated field for the total bilateral trade (i.e. exports + imports) and balance of trade (i.e. exports - imports). Be sure to use IFNULL to convert nulls to zeroes as null + value will return a null. This will cause the later visualisation to be wrong as data will be missed.\r\n\r\n4\r\nNow to begin creating the bubble charts. First, drag the import and export measures from the Data pane on the left to row and column respectively.\r\n\r\n5\r\nThen, select ‘circle’ under Marks. To color code the chart by country/region, drag the Country/Region dimension to the Color button under Marks. Then click on the Color button and set the opacity to ~50% and the border to white. To make the bubble size proportional to total bilateral trade volume, drag Total Bilateral Trade calculated measure to Size button under Marks.\r\n\r\n6\r\nWe now want to filter the chart to only see the ten countries/regions identified in the original visualisation. Drag the Country/Region and to the Filters tab and select the ten countries/regions.\r\n\r\n7\r\nWe want to create a toggle to allow the user to select the year for which we will display the data. However, we want to limit the user’s options to just the years between 2011 to 2020. To do so, we will need to create a copy of the Date dimension. Then drag the Date (copy) dimension to the Filters tab, select “Year” when prompted, and then select all the years between 2011 and 2020. Then drag Date to the Filters tab, select “Year” when prompted, and then select “2011”. Once the filter has been established, right-click the filter and select “Show Filter”. You should see the filter selector appear on the right.\r\n\r\n8\r\nAdjust the filter toggle’s settings to get the desired output. Click the top-right corner of the filter toggle and select “Single Value (list)” option and the “Only Relevant Values” option. Then navigate to “Customise” and uncheck the “Show ‘All’ Value” option.\r\n\r\n9\r\nNow we want to create the centroid of each bubble to that users can easily compare the respective import/export positions of the different countries. To do this we will use Dual Axes to plot the same Export vs Import data on top of the bubble chart. Drag the Export measure to the top edge of the chart till you see a dotted line appear. Do the same with the Import measure on the right edge of the chart.\r\n\r\n10\r\nSelect ‘Circle’ as the mark type, and select white as the color. Adjust the size of the centroid by clicking the Size button on the Marks tab and making the adjustment using the slider. We will also use this mark to label the bubbles, so drag Country/Region and Total Bilateral Trade to the Label button in the Marks tab. Change the number format of Total Bilateral Trade so that it displays in billions and one decimal place. Remove the secondary axes by right-clicking and unchecking “Show Header”.\r\n\r\n11\r\nWe now want to standardise the axes to ensure that the left and right bubble charts are always directly comparable. Right-click the Import axis and select “Edit Axis”. Set the Range to “Fixed” and fix the range between 0 and 80B. Also edit the axis title to include the units. Repeat with the Export axis.\r\n\r\n12\r\nWe want each bubble chart to be labelled with the selected year so that users can see which two years they are comparing. To do this, double click the sheet title on the top of the sheet and change the text to a variable, \"<Year(Date)>. The title of the bubble chart will now display the selected year.\r\n\r\n13\r\nIn order to give the user an idea of how the relationship changes over time, we will introduce animations that will kick in whenever the user toggles the year for the bubble chart. The movement will highlight to the user the relative changes in the trade relationship of respective countries. Select Format from the ribbon and click on Animations. Then on the Animations pane, select “On” and set the duration to “Medium”.\r\n\r\n14\r\nNow we will create the custom tooltip so that the user can get an informative analysis when he mouses over the respective bubble.  To create the reactive color coding and “+/-” prefix for the balance of trade, we will need to create two calculated fields, one field, bot_neg will be null when the balance of trade is positive, and the other field, bot_pos will be null when the balance of trade is negative. Use an IF statement to do this. Next, we also want to have reactive text highlighting whether Singapore is a net importer from or exporter to the respective country. We do this similarly with IF statement to create two more calculated variables, net_imp-exp and to_from. We separate out the “to/from” so that we can highlight the “net importer”/“net exporter” with an increased font size. Once done, drag all the new calculated fields into the Tooltip button on the Marks tab. Now drag the Date into the Tooltip button as well. Date is trickier because there are multiple dates to be aggregated as the date in the data is given by month. To resolve this issue, we select “Maximum” under Measure and adjust the format of the date to show only the year. Finally put it all together by clicking the Tooltip button and typing the text out as shown.\r\n\r\n15\r\nHurray! You are now done with the bubble chart. Name this sheet “Left” and duplicate the sheet by right-clicking the sheet tab at the bottom and clicking duplicate. Name this sheet “Right”\r\n\r\n16\r\nWe now create the line graphs to show the total bilateral trade and balance of trade over time. To do so, create a new sheet and drag Total Bilateral Trade to rows and Date to columns. Select “Year” to aggreagate the measure by year. Filter by Country/Region and Date so that we only see the ten countries we are studying and the data is shown for 2011 to 2020. Color code by country region and add in a country/region label (see similar steps above if unsure). Name this sheet “Bilat Trade”. Create an informative tooltip.\r\n\r\n17\r\nCreate another new sheet. Drag Balance of Trade to rows and Date to columns. Select “Year” to aggreagate the measure by year. Filter by Country/Region and Date so that we only see the ten countries we are studying and the data is shown for 2011 to 2020. Color code by country region and add in a country/region label (see similar steps above if unsure). Name this sheet “BoT” for Balance of Trade.\r\n\r\n18\r\nWe want to create some additional annotations on the BoT chart to highlight to users when a country is a net importer or exporter. First create a reference line by right-clicking the vertical axis and clicking “Add Reference Line”. Format the reference line so that it stands out. Label this line “Breakeven point” and fill the area below the line grey. Format the reference line label by clicking on the reference line and selecting format. Adjust the text to make it prominent and set the shading opacity. Right-click anywhere on the chart and create an area annotation. Do one for “Net Exporter” and one for “Net Importer”. Adjust the font colors and positioning to make clear which area of the graph the annotation is referring to.\r\n\r\n19\r\nCreate an informative tooltip (see similar steps above if unsure).\r\n\r\n20\r\nNow put everything together by creating a new dashboard. Drag and drop the various sheets onto the dashboard and position accordingly. We will use floating text tiles to show that the two bubble charts are meant to be compared by putting a “vs” in the middle. We will also use the floating text tile to create an annotation that the bubble sizes are based on total bilateral trade volume. Create a floating text tile by selecting “Floating” under the Dashboard pane and dragging a text tile from “Objects” onto the dashboard.\r\n\r\nAnd now you’re done!\r\n4. New Visualisation and Observations\r\nExecuting the visualisation described in Section 2, we produce the following graphic. The workbook can also be accessed on Tableau Public here.\r\n\r\nExample of New data visualisation\r\nEmbedded Interactive Visualisation\r\n\r\n\r\n                                    var divElement = document.getElementById('viz1624200890209');                    var vizElement = divElement.getElementsByTagName('object')[0];                    if ( divElement.offsetWidth > 800 ) { vizElement.style.width='100%';vizElement.style.height=(divElement.offsetWidth*0.75)+'px';} else if ( divElement.offsetWidth > 500 ) { vizElement.style.width='100%';vizElement.style.height=(divElement.offsetWidth*0.75)+'px';} else { vizElement.style.width='100%';vizElement.style.height='1577px';}                     var scriptElement = document.createElement('script');                    scriptElement.src = 'https://public.tableau.com/javascripts/api/viz_v1.js';                    vizElement.parentNode.insertBefore(scriptElement, vizElement);                \r\nFrom the visualisation, we can make the following observations:\r\nSince 2011, our trade with China and the United States has grown most strongly, with China surpassing Malaysia as our main trading partner in 2013. The increase in merchandise trade volume with the United States has been driven by strong export growth, which has caused the relationship to evolve from a net importer to net exporter in 2020. With China, growth is more even between both imports and exports and our balance of trade has been largely hovering between +1.0B to +13.0B.\r\nOur trading relationship with Malaysia has been steadily changing over time, from a net exporter with +14.9B balance of trade in 2011 to a net importer with -11.6B balance of trade in 2020. This could be due to a shift in our economy to focus more on high-tech manufacturing and services which have less demand in Malaysia, while we continue to purchase large quantities of food and other commodities from Malaysia.\r\nOur well diversified portfolio of trading relationships allows us to maintain a health balance of trade. Even though relationships with individual countries have been changing significantly over time due to trends in the global economy as well as Singapore’s efforts to transform our economy to remain relevant in the future, we are still able to maintain a healthy current account balance as we balance lost export revenue from some countries with increased export revenue to other countries.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-21T05:38:00+08:00",
    "input_file": "dataviz2.knit.md"
  },
  {
    "path": "posts/2021-05-30-dataviz1/",
    "title": "Data Viz Makeover 1",
    "description": "A critque and makeover of a Singapore trade data visualisation.",
    "author": [
      {
        "name": "Arnold Ng",
        "url": {}
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Critique of the visualisation\r\n1.1 Clarity\r\n1.2 Aesthetics\r\n\r\n2. Proposed alternative visualisation\r\n2.1 Proposed narrative\r\n2.2 Sketch of alternative visualisation\r\n\r\n3. Step-by-step guide on preparing data visualisation in Tableau\r\n3.1 Data preparation in Excel\r\n3.2 Visualisation in Tableau\r\n\r\n4. New Visualisation and Observations\r\n\r\n1. Critique of the visualisation\r\n\r\nOriginal data visualisation\r\n1.1 Clarity\r\nThe intent of the visualisation is to describe Singapore’s top six merchandise trade relationships between 2019 and 2020. However, it is difficult to discern a clear narrative from the visualisation because:\r\nThe axes ranges are not standardised across each graph in the grid. This makes it difficult to compare the trends and figures from each country with each other as each are on different scales.\r\nOn each grid, the primary (export) and secondary (import) axes ranges are not standardised. This makes it difficult to compare the relative proportion of import to exports for each trading partner. This proportion informs the reader whether the Singapore has a trade deficit or surplus with the respective trading partner. This detail is one of the key statistics used in defining a trading relationship.\r\nThe time scales are not standardised across the different trading partners. Japan only has data for 2020, while all the others show data from 2019 to 2021.\r\nThe time scales also do not match the title, which says “Merchandise Trade of Top Six Trading Countries, 2019-2020” even though 5 of the 6 grids show data going all the way to 2021, and the remaining grid (Japan) only shows data from 2020.\r\nIt is not be meaningful to visualise the data as a time series as the data shows little variation between 2019 and 2020, as would be expected as trade relationships rarely change significantly over a period of one to two years.\r\n1.2 Aesthetics\r\nBesides clarity the aesthetics of the visualisation could also be improved. Some observed weaknesses are:\r\nUse of area graphs clutters the visualisation with unnecessary data ink. The fill is not meaningful as it does not help to highlight anything from the data. Simple line graphs could easily communicate the same message with less clutter.\r\nUse of individual axes for each graph clutters the visualisation with alot of non-data ink.  Standardising the axes would not only fix clarity issues (mentioned in Section 1.1), but also allow the removal of the axes from some of the grids to reduce non-data ink which distracts from the actual visualisation.\r\nGrid is too small making it difficult to make out details in the data. Visualising the data individually for each country results in a very cramped grid which is difficult to read as each graph is too small.\r\nWasted white space below the color legend. The space in the visualisation is not utilised well. With the main visualisation already cramped, the space under the legend could have been better utilised by data ink.\r\n2. Proposed alternative visualisation\r\n2.1 Proposed narrative\r\nThe visualisation should inform the reader about Singapore’s merchandise trade based on the trading volume data. The user should be able to draw some key insights such as:\r\nWho are Singapore’s biggest trading partners?\r\nIs Singapore too dependent on a handful of countries?\r\nDoes Singapore import more than we export?\r\nThis narrative will help to give the reader an idea of Singapore’s merchandise trade dependecies.\r\n2.2 Sketch of alternative visualisation\r\nBased on the above narrative, it is proposed that the data be visualised as a “pyramid” chart, where:\r\nExport and Import volumes are visualised side by side on inverted axes. This will allow a reader to immediately see the total bilateral trade volume for a given country/region. It also informs the reader of the nature of the trading relationship with that country/region (e.g. surplus or deficit).\r\nThe data is sorted in descending order of total bilateral trade volume. This will allow the reader to immediately see which are our most important trading partners.\r\nData should be truncated to the top N trading relationships so that the visualisation does not get too cluttered. N should be a nice round number (e.g. 10, 20) to make for easy reading.\r\nAxes should be removed to reduce non-data ink. They are unnecessary anyway, as the relative differences in the trading volumes are well captured by the length of the bars. We can also add data labels for easy reading.\r\nImports are put on the left as people tend to associate the rightward direction with outgoing and the leftward direction with incoming. This helps to make the visualisation more intuitive.\r\nUse the same colors, but different shades, for imports and exports. This helps to reduce the number of different colours on the page and helps the reader to focus on the length of the bars which is the main focus of the visualisation.\r\nAdditional visualisation at the bottom shows how big a share of our merchandise trading volumes is dependent on the top N countries. This will help to give the reader a sense of our dependence on these relationships.\r\n\r\nSketch of proposed data visualisation\r\n3. Step-by-step guide on preparing data visualisation in Tableau\r\n3.1 Data preparation in Excel\r\nIn order to use the data in Tableau to generate the desired visualisation, we would first have to “unstack” the table and ensure that the date is stored as a dimension, rather than be used as a column name. This will allow Tableau to process the data as a time series.\r\n\r\nData transformation required\r\nThis data transformation can be done using Excel VBA. Be sure to pay attention to the data, as there might be some inconsistency that will impact the transformation. For example, “na” is usually used to denote missing data. However, from Jan 1998 to Dec 1998, trade data for imports from ‘Yemen Democratic’ was indicated by ‘-’. The macro below includes code breaks to help pick out such issues. In this case, simple replace all ‘-’ with ‘na’.\r\nYou may refer here for details on how to use VBA on Microsoft Excel. The site will show you how to access the script editor. I’ve also provided the script I used to process the data below. This script can be copied into the script editor and run to transform the data into the desired form.\r\nExample VBA script to perform data transformation:\r\n\r\n#VBA code to execute data processing\r\n\r\nSub unstack_table()\r\n\r\nDim data_range As Range\r\nDim data As String\r\n\r\nIf ActiveSheet.Name = \"T1\" Then\r\n    data = \"Imports\"\r\nElseIf ActiveSheet.Name = \"T2\" Then\r\n    data = \"Exports\"\r\nElse\r\n    GoTo err_break1\r\nEnd If\r\n\r\nSet data_range = Range(\"B8\", Range(\"B8\").End(xlDown).End(xlToRight))\r\n\r\nFor i = 1 To data_range.Rows.Count\r\n    For j = 1 To data_range.Columns.Count\r\n        If data_range.Cells(i, j) <> \"na\" Then\r\n            Sheets(data).Cells(1, 1).End(xlDown).Offset(1).Value = _\r\n              Trim(Split(data_range.Cells(i, 1).Offset(, -1).Text, \"(\")(0))\r\n            Sheets(data).Cells(1, 2).End(xlDown).Offset(1).Value = _\r\n              Split(data_range.Cells(1, j).Offset(-2).Text, \" \")(1) & \" \" & _\r\n              Split(data_range.Cells(1, j).Offset(-2).Text, \" \")(0)\r\n            If Split(data_range.Cells(i, 1).Offset(, -1).Text, \"(\")(1) = _\r\n              \"Thousand Dollars)\" Then\r\n                Sheets(data).Cells(1, 3).End(xlDown).Offset(1).Value = _\r\n                  data_range.Cells(i, j).Value * 1000\r\n            ElseIf Split(data_range.Cells(i, 1).Offset(, -1).Text, \"(\")(1) = _\r\n              \"Million Dollars)\" Then\r\n                Sheets(data).Cells(1, 3).End(xlDown).Offset(1).Value = _\r\n                data_range.Cells(i, j).Value * 1000000\r\n            Else\r\n                GoTo err_break2\r\n            End If\r\n        End If\r\n    Next j\r\nNext i\r\n\r\nGoTo endsub\r\n\r\nerr_break1:\r\n\r\nMsgBox \"Select either sheet T1 or T2 to run the macro\"\r\n\r\nGoTo endsub\r\n\r\nerr_break2:\r\n\r\nMsgBox \"Something is wrong with \" & data_range.Cells(i, 1).Offset(, -1).Text\r\n\r\nendsub:\r\n\r\nEnd Sub\r\n\r\nPerform this transformation on both the Import and Export data to generate two separate tables. Note that in the event of ‘na’, the data is not copied over, which will result in ‘null’ returns when the data is visualised in Tableau. This should be the correct interpretation for the missing data at this point, as we cannot assume that missing data means that there was no trade at all (which is indicated by a zero in the data).\r\n3.2 Visualisation in Tableau\r\nOnce the data has been prepared, we now move to Tableau to execute the proposed visualisation.\r\nStep\r\nActions Required\r\nScreenshot\r\n1\r\nFirst, load the processed data into Tableau and join the Import and Export tables. We should use a full outer join as there will be cases where a country has registered exports but no registered imports for the given time period and vice versa. Any other form of join (e.g. left outer, right outer, inner) will result in loss of data. The data should be joined on Country/Region and Date\r\n\r\n2\r\nNext, create calculated fields to consolidate the data for Country/Region and Date as these fields will be nil for some rows if we only look at Imports or Exports. We can do this using an IFNULL statement.\r\n\r\n3\r\nNow create a calculated field for the total bilateral trade (i.e. exports + imports). We will be using this value to rank the countries/regions later. Be sure to use IFNULL to convert nulls to zeroes as null + value will return a null. This will cause the later visualisation to be wrong as data will be missed.\r\n\r\n4\r\nCreate the centrepiece of the data visualisation, the ‘pyramid’ bar chart. We do this by dragging Imports and Exports into the columns and setting the visualisation to bar. Change the color of the Exports bars to differentiate them from the Imports bars by selecting Color on the Marks tab and editing the color for the Exports bar graph. Then we drag Country/Region into the rows so that the data is split by country/region. To achieve row banding for better visualisation, right-click Country/Region and select Format. Then select the Shading tab (i.e. the third tab) and choose a colour for Pane under Row Banding. Set the Banding Size to the second notch. Finally, we use the filters to filter the data by date to 2019-2020 which is the time range specified in the original visualisation.\r\n\r\n5\r\nRight-click the horizontal axis of Imports, which should be on the left side of the graph and reverse the axis so that the origin starts from the right instead of the left. This will create the “pyramid” look\r\n\r\n6\r\nWhile on the edit axis menu, select Tick Marks and set both major and minor tick marks to None. We don’t want to clutter out visualisation with non-data ink! Repeat this with the Export axis and then hide both axes by right-clicking and deselecting the Show Header option.\r\n\r\n7\r\nAdd data labels by dragging Imports and Exports to the respective Marks tab. Format the number by clicking on the right side of the green pill bar and selecting Format. Then select Pane and edit the number format in Number. We want to visualise the number in ‘billions’ to reduce the length of the numbers and reduce clutter in our visualisation.\r\n\r\n8\r\nRight-click the Country/Region headers on the left and click Format. Then adjust the fonts and size in the Header tab.\r\n\r\n9\r\nNow right-click the Country/Region pill bar under Rows and select Sort. We will now sort the data in the bar graphs by total bilateral trade volumes to identify our most important merchandise trade relationships.\r\n\r\n10\r\nNotice that interspersed among our biggest trade relationships are regions which are actually whole continents (e.g. Asia, America). These are aggregated data from the countries that belong in the respective continent or region (e.g. European Union). We will have to remove this data from the visualisation to avoid double counting. Drag the Country/Region dimension into the Filters tab and then right-click and Edit Filter. Uncheck the continents and regions.\r\n\r\n11\r\nNow we can see all out trading relationships between 2019-2020. We shall pick the top 20 relationships for the visualisation. Right-click the Country/Region filter and select the Top tab. Then select By field and specify the top 20 in Total Bilateral Trade. You are now done with the centrepiece graph!\r\n\r\n12\r\nTo create the bars showing the proportion of total trading volume contributed by the top 20 countries/regions, we will need to do so on a new worksheet. Create a new sheet by selecting the New Worksheet button at the the bottom.\r\n\r\n13\r\nDrag Imports to columns and select Bar as the type of mark. Perform the necessary filtering as described in Steps 4 and 10. In order to reuse this for the Exports chart, right-click the Country/Regions filter and click Create Set. You can call this set “Less Regions Set”\r\n\r\n14\r\nCreate a another set by right-clicking Country/Region under the Data tab on the left of the screen. Then select Create and Set. In this set, select the top 20 countries as identified from the visualisation generated in Steps 1 to 11.\r\n\r\n15\r\nNow drag this new set into the Marks tab and set it to color. Then click the Color button on the Marks tab and click Edit Colors…. Choose the colors for the IN and OUT. This specifies the colors for data within the top 20 countries set and outside the top 20 countries set. We will make them blue and gray for maximum contrast as shade is already used to distinguish between exports and imports.\r\n\r\n16\r\nWe will need the data labels to be informative as we want to reduce clutter and non-data ink. Therefore, we will need to create a calculated field that will label the top 20 countries data with “Top 20:” and not label anything on the data outside the set.\r\n\r\n17\r\nThen use Quick Table Calculation to create the Percent of Total to add to the data label.\r\n\r\n18\r\nPut it all together by using the Edit Label function in the Marks tab as shown.\r\n\r\n19\r\nRepeat this for Exports.\r\n\r\n20\r\nFinally, it is time to put everything together into our final visualisation. We will use a dashboard to do this, so create a dashboard by clicking the respective button at the bottom.\r\n\r\n21\r\nDrag the sheets onto the page and arrange them in a neat order. Use the Blank objects for spacers as needed and the Text objects to input text into your visualisations.\r\n\r\n22\r\nUse the Layout tab to provide background color for your text objects as needed.\r\n\r\nAnd now you’re done!\r\n4. New Visualisation and Observations\r\nExecuting the visualisation described in Section 2, we produce the following graphic. The workbook can also be accessed on Tableau Public here.\r\n\r\nNew data visualisation\r\nFrom the visualisation, we can make the following observations:\r\nIt becomes immediately apparent that the original visualisation was incorrect in identifying Singapore’s top 6 merchandise trade relationships. It should be Indonesia and not Japan which is included in the top 6.\r\nWe have a diverse and global set of trading partners, with four continents represented amongst our top 20 merchandise trading relationships.\r\nOur top 5 trade relationships account for nearly half of our merchandise trade by volume, and our top 20 account for about 90% of our merchandise trade. This shows that while we are fairly well diversified geographically speaking, Singapore is still quite dependent on a handful of major trading partners.\r\nWe are a net exporter. We export about 10% more merchandise (by value) than we import, which indicates that we run a trade surplus with regards to merchandise. Some of our trade relationships feature a significant trade imbalance (e.g. trade with Hong kong runs a signficant surplus, while trade with Taiwan runs a significant deficit). This information, along with information types of merchandise exported, services trade data, etc. are important to inform our exchange rate policy, which has significant impacts on our trade.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-21T05:38:29+08:00",
    "input_file": "my-1st-post.knit.md"
  }
]
