[
  {
    "path": "posts/2021-06-20-dataviz2/",
    "title": "Data Viz Makeover 2",
    "description": "A critque and makeover of a Singapore trade data visualisation.",
    "author": [
      {
        "name": "Arnold Ng",
        "url": {}
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Critique of the visualisation\r\n1.1 Clarity\r\n1.2 Aesthetics\r\n\r\n2. Proposed alternative visualisation\r\n2.1 Proposed narrative\r\n2.2 Sketch of alternative visualisation\r\n\r\n3. Step-by-step guide on preparing data visualisation in Tableau\r\n3.1 Data preparation in Excel\r\n3.2 Visualisation in Tableau\r\n\r\n4. New Visualisation and Observations\r\n\r\n1. Critique of the visualisation\r\n\r\nOriginal data visualisation\r\n1.1 Clarity\r\nThe intent of the visualisation is to describe Singapore’s top six merchandise trade relationships between 2019 and 2020. However, it is difficult to discern a clear narrative from the visualisation because:\r\nThe axes ranges are not standardised across each graph in the grid. This makes it difficult to compare the trends and figures from each country with each other as each are on different scales.\r\nOn each grid, the primary (export) and secondary (import) axes ranges are not standardised. This makes it difficult to compare the relative proportion of import to exports for each trading partner. This proportion informs the reader whether the Singapore has a trade deficit or surplus with the respective trading partner. This detail is one of the key statistics used in defining a trading relationship.\r\nThe time scales are not standardised across the different trading partners. Japan only has data for 2020, while all the others show data from 2019 to 2021.\r\nThe time scales also do not match the title, which says “Merchandise Trade of Top Six Trading Countries, 2019-2020” even though 5 of the 6 grids show data going all the way to 2021, and the remaining grid (Japan) only shows data from 2020.\r\nIt is not be meaningful to visualise the data as a time series as the data shows little variation between 2019 and 2020, as would be expected as trade relationships rarely change significantly over a period of one to two years.\r\n1.2 Aesthetics\r\nBesides clarity the aesthetics of the visualisation could also be improved. Some observed weaknesses are:\r\nUse of area graphs clutters the visualisation with unnecessary data ink. The fill is not meaningful as it does not help to highlight anything from the data. Simple line graphs could easily communicate the same message with less clutter.\r\nUse of individual axes for each graph clutters the visualisation with alot of non-data ink.  Standardising the axes would not only fix clarity issues (mentioned in Section 1.1), but also allow the removal of the axes from some of the grids to reduce non-data ink which distracts from the actual visualisation.\r\nGrid is too small making it difficult to make out details in the data. Visualising the data individually for each country results in a very cramped grid which is difficult to read as each graph is too small.\r\nWasted white space below the color legend. The space in the visualisation is not utilised well. With the main visualisation already cramped, the space under the legend could have been better utilised by data ink.\r\n2. Proposed alternative visualisation\r\n2.1 Proposed narrative\r\nThe visualisation should inform the reader about Singapore’s merchandise trade based on the trading volume data. The user should be able to draw some key insights such as:\r\nWho are Singapore’s biggest trading partners?\r\nIs Singapore too dependent on a handful of countries?\r\nDoes Singapore import more than we export?\r\nThis narrative will help to give the reader an idea of Singapore’s merchandise trade dependecies.\r\n2.2 Sketch of alternative visualisation\r\nBased on the above narrative, it is proposed that the data be visualised as a “pyramid” chart, where:\r\nExport and Import volumes are visualised side by side on inverted axes. This will allow a reader to immediately see the total bilateral trade volume for a given country/region. It also informs the reader of the nature of the trading relationship with that country/region (e.g. surplus or deficit).\r\nThe data is sorted in descending order of total bilateral trade volume. This will allow the reader to immediately see which are our most important trading partners.\r\nData should be truncated to the top N trading relationships so that the visualisation does not get too cluttered. N should be a nice round number (e.g. 10, 20) to make for easy reading.\r\nAxes should be removed to reduce non-data ink. They are unnecessary anyway, as the relative differences in the trading volumes are well captured by the length of the bars. We can also add data labels for easy reading.\r\nImports are put on the left as people tend to associate the rightward direction with outgoing and the leftward direction with incoming. This helps to make the visualisation more intuitive.\r\nUse the same colors, but different shades, for imports and exports. This helps to reduce the number of different colours on the page and helps the reader to focus on the length of the bars which is the main focus of the visualisation.\r\nAdditional visualisation at the bottom shows how big a share of our merchandise trading volumes is dependent on the top N countries. This will help to give the reader a sense of our dependence on these relationships.\r\n\r\nSketch of proposed data visualisation\r\n3. Step-by-step guide on preparing data visualisation in Tableau\r\n3.1 Data preparation in Excel\r\nIn order to use the data in Tableau to generate the desired visualisation, we would first have to “unstack” the table and ensure that the date is stored as a dimension, rather than be used as a column name. This will allow Tableau to process the data as a time series.\r\n\r\nData transformation required\r\nThis data transformation can be done using Excel VBA. Be sure to pay attention to the data, as there might be some inconsistency that will impact the transformation. For example, “na” is usually used to denote missing data. However, from Jan 1998 to Dec 1998, trade data for imports from ‘Yemen Democratic’ was indicated by ‘-’. The macro below includes code breaks to help pick out such issues. In this case, simple replace all ‘-’ with ‘na’.\r\nYou may refer here for details on how to use VBA on Microsoft Excel. The site will show you how to access the script editor. I’ve also provided the script I used to process the data below. This script can be copied into the script editor and run to transform the data into the desired form.\r\nExample VBA script to perform data transformation:\r\n\r\n#VBA code to execute data processing\r\n\r\nSub unstack_table()\r\n\r\nDim data_range As Range\r\nDim data As String\r\n\r\nIf ActiveSheet.Name = \"T1\" Then\r\n    data = \"Imports\"\r\nElseIf ActiveSheet.Name = \"T2\" Then\r\n    data = \"Exports\"\r\nElse\r\n    GoTo err_break1\r\nEnd If\r\n\r\nSet data_range = Range(\"B8\", Range(\"B8\").End(xlDown).End(xlToRight))\r\n\r\nFor i = 1 To data_range.Rows.Count\r\n    For j = 1 To data_range.Columns.Count\r\n        If data_range.Cells(i, j) <> \"na\" Then\r\n            Sheets(data).Cells(1, 1).End(xlDown).Offset(1).Value = _\r\n              Trim(Split(data_range.Cells(i, 1).Offset(, -1).Text, \"(\")(0))\r\n            Sheets(data).Cells(1, 2).End(xlDown).Offset(1).Value = _\r\n              Split(data_range.Cells(1, j).Offset(-2).Text, \" \")(1) & \" \" & _\r\n              Split(data_range.Cells(1, j).Offset(-2).Text, \" \")(0)\r\n            If Split(data_range.Cells(i, 1).Offset(, -1).Text, \"(\")(1) = _\r\n              \"Thousand Dollars)\" Then\r\n                Sheets(data).Cells(1, 3).End(xlDown).Offset(1).Value = _\r\n                  data_range.Cells(i, j).Value * 1000\r\n            ElseIf Split(data_range.Cells(i, 1).Offset(, -1).Text, \"(\")(1) = _\r\n              \"Million Dollars)\" Then\r\n                Sheets(data).Cells(1, 3).End(xlDown).Offset(1).Value = _\r\n                data_range.Cells(i, j).Value * 1000000\r\n            Else\r\n                GoTo err_break2\r\n            End If\r\n        End If\r\n    Next j\r\nNext i\r\n\r\nGoTo endsub\r\n\r\nerr_break1:\r\n\r\nMsgBox \"Select either sheet T1 or T2 to run the macro\"\r\n\r\nGoTo endsub\r\n\r\nerr_break2:\r\n\r\nMsgBox \"Something is wrong with \" & data_range.Cells(i, 1).Offset(, -1).Text\r\n\r\nendsub:\r\n\r\nEnd Sub\r\n\r\nPerform this transformation on both the Import and Export data to generate two separate tables. Note that in the event of ‘na’, the data is not copied over, which will result in ‘null’ returns when the data is visualised in Tableau. This should be the correct interpretation for the missing data at this point, as we cannot assume that missing data means that there was no trade at all (which is indicated by a zero in the data).\r\n3.2 Visualisation in Tableau\r\nOnce the data has been prepared, we now move to Tableau to execute the proposed visualisation.\r\nStep\r\nActions Required\r\nScreenshot\r\n1\r\nFirst, load the processed data into Tableau and join the Import and Export tables. We should use a full outer join as there will be cases where a country has registered exports but no registered imports for the given time period and vice versa. Any other form of join (e.g. left outer, right outer, inner) will result in loss of data. The data should be joined on Country/Region and Date\r\n\r\n2\r\nNext, create calculated fields to consolidate the data for Country/Region and Date as these fields will be nil for some rows if we only look at Imports or Exports. We can do this using an IFNULL statement.\r\n\r\n3\r\nNow create a calculated field for the total bilateral trade (i.e. exports + imports). We will be using this value to rank the countries/regions later. Be sure to use IFNULL to convert nulls to zeroes as null + value will return a null. This will cause the later visualisation to be wrong as data will be missed.\r\n\r\n4\r\nCreate the centrepiece of the data visualisation, the ‘pyramid’ bar chart. We do this by dragging Imports and Exports into the columns and setting the visualisation to bar. Change the color of the Exports bars to differentiate them from the Imports bars by selecting Color on the Marks tab and editing the color for the Exports bar graph. Then we drag Country/Region into the rows so that the data is split by country/region. To achieve row banding for better visualisation, right-click Country/Region and select Format. Then select the Shading tab (i.e. the third tab) and choose a colour for Pane under Row Banding. Set the Banding Size to the second notch. Finally, we use the filters to filter the data by date to 2019-2020 which is the time range specified in the original visualisation.\r\n\r\n5\r\nRight-click the horizontal axis of Imports, which should be on the left side of the graph and reverse the axis so that the origin starts from the right instead of the left. This will create the “pyramid” look\r\n\r\n6\r\nWhile on the edit axis menu, select Tick Marks and set both major and minor tick marks to None. We don’t want to clutter out visualisation with non-data ink! Repeat this with the Export axis and then hide both axes by right-clicking and deselecting the Show Header option.\r\n\r\n7\r\nAdd data labels by dragging Imports and Exports to the respective Marks tab. Format the number by clicking on the right side of the green pill bar and selecting Format. Then select Pane and edit the number format in Number. We want to visualise the number in ‘billions’ to reduce the length of the numbers and reduce clutter in our visualisation.\r\n\r\n8\r\nRight-click the Country/Region headers on the left and click Format. Then adjust the fonts and size in the Header tab.\r\n\r\n9\r\nNow right-click the Country/Region pill bar under Rows and select Sort. We will now sort the data in the bar graphs by total bilateral trade volumes to identify our most important merchandise trade relationships.\r\n\r\n10\r\nNotice that interspersed among our biggest trade relationships are regions which are actually whole continents (e.g. Asia, America). These are aggregated data from the countries that belong in the respective continent or region (e.g. European Union). We will have to remove this data from the visualisation to avoid double counting. Drag the Country/Region dimension into the Filters tab and then right-click and Edit Filter. Uncheck the continents and regions.\r\n\r\n11\r\nNow we can see all out trading relationships between 2019-2020. We shall pick the top 20 relationships for the visualisation. Right-click the Country/Region filter and select the Top tab. Then select By field and specify the top 20 in Total Bilateral Trade. You are now done with the centrepiece graph!\r\n\r\n12\r\nTo create the bars showing the proportion of total trading volume contributed by the top 20 countries/regions, we will need to do so on a new worksheet. Create a new sheet by selecting the New Worksheet button at the the bottom.\r\n\r\n13\r\nDrag Imports to columns and select Bar as the type of mark. Perform the necessary filtering as described in Steps 4 and 10. In order to reuse this for the Exports chart, right-click the Country/Regions filter and click Create Set. You can call this set “Less Regions Set”\r\n\r\n14\r\nCreate a another set by right-clicking Country/Region under the Data tab on the left of the screen. Then select Create and Set. In this set, select the top 20 countries as identified from the visualisation generated in Steps 1 to 11.\r\n\r\n15\r\nNow drag this new set into the Marks tab and set it to color. Then click the Color button on the Marks tab and click Edit Colors…. Choose the colors for the IN and OUT. This specifies the colors for data within the top 20 countries set and outside the top 20 countries set. We will make them blue and gray for maximum contrast as shade is already used to distinguish between exports and imports.\r\n\r\n16\r\nWe will need the data labels to be informative as we want to reduce clutter and non-data ink. Therefore, we will need to create a calculated field that will label the top 20 countries data with “Top 20:” and not label anything on the data outside the set.\r\n\r\n17\r\nThen use Quick Table Calculation to create the Percent of Total to add to the data label.\r\n\r\n18\r\nPut it all together by using the Edit Label function in the Marks tab as shown.\r\n\r\n19\r\nRepeat this for Exports.\r\n\r\n20\r\nFinally, it is time to put everything together into our final visualisation. We will use a dashboard to do this, so create a dashboard by clicking the respective button at the bottom.\r\n\r\n21\r\nDrag the sheets onto the page and arrange them in a neat order. Use the Blank objects for spacers as needed and the Text objects to input text into your visualisations.\r\n\r\n22\r\nUse the Layout tab to provide background color for your text objects as needed.\r\n\r\nAnd now you’re done!\r\n4. New Visualisation and Observations\r\nExecuting the visualisation described in Section 2, we produce the following graphic. The workbook can also be accessed on Tableau Public here.\r\n\r\nNew data visualisation\r\nFrom the visualisation, we can make the following observations:\r\nIt becomes immediately apparent that the original visualisation was incorrect in identifying Singapore’s top 6 merchandise trade relationships. It should be Indonesia and not Japan which is included in the top 6.\r\nWe have a diverse and global set of trading partners, with four continents represented amongst our top 20 merchandise trading relationships.\r\nOur top 5 trade relationships account for nearly half of our merchandise trade by volume, and our top 20 account for about 90% of our merchandise trade. This shows that while we are fairly well diversified geographically speaking, Singapore is still quite dependent on a handful of major trading partners.\r\nWe are a net exporter. We export about 10% more merchandise (by value) than we import, which indicates that we run a trade surplus with regards to merchandise. Some of our trade relationships feature a significant trade imbalance (e.g. trade with Hong kong runs a signficant surplus, while trade with Taiwan runs a significant deficit). This information, along with information types of merchandise exported, services trade data, etc. are important to inform our exchange rate policy, which has significant impacts on our trade.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T17:27:08+08:00",
    "input_file": "dataviz2.knit.md"
  },
  {
    "path": "posts/2021-05-22-my-1st-post/",
    "title": "Data Viz Makeover 1",
    "description": "A critque and makeover of a Singapore trade date visualisation.",
    "author": [
      {
        "name": "Arnold Ng",
        "url": {}
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Critique of the visualisation\r\n1.1 Clarity\r\n1.2 Aesthetics\r\n\r\n2. Proposed alternative visualisation\r\n2.1 Proposed narrative\r\n2.2 Sketch of alternative visualisation\r\n\r\n3. Step-by-step guide on preparing data visualisation in Tableau\r\n3.1 Data preparation in Excel\r\n3.2 Visualisation in Tableau\r\n\r\n4. New Visualisation and Observations\r\n\r\n1. Critique of the visualisation\r\n\r\nOriginal data visualisation\r\n1.1 Clarity\r\nThe intent of the visualisation is to describe Singapore’s top six merchandise trade relationships between 2019 and 2020. However, it is difficult to discern a clear narrative from the visualisation because:\r\nThe axes ranges are not standardised across each graph in the grid. This makes it difficult to compare the trends and figures from each country with each other as each are on different scales.\r\nOn each grid, the primary (export) and secondary (import) axes ranges are not standardised. This makes it difficult to compare the relative proportion of import to exports for each trading partner. This proportion informs the reader whether the Singapore has a trade deficit or surplus with the respective trading partner. This detail is one of the key statistics used in defining a trading relationship.\r\nThe time scales are not standardised across the different trading partners. Japan only has data for 2020, while all the others show data from 2019 to 2021.\r\nThe time scales also do not match the title, which says “Merchandise Trade of Top Six Trading Countries, 2019-2020” even though 5 of the 6 grids show data going all the way to 2021, and the remaining grid (Japan) only shows data from 2020.\r\nIt is not be meaningful to visualise the data as a time series as the data shows little variation between 2019 and 2020, as would be expected as trade relationships rarely change significantly over a period of one to two years.\r\n1.2 Aesthetics\r\nBesides clarity the aesthetics of the visualisation could also be improved. Some observed weaknesses are:\r\nUse of area graphs clutters the visualisation with unnecessary data ink. The fill is not meaningful as it does not help to highlight anything from the data. Simple line graphs could easily communicate the same message with less clutter.\r\nUse of individual axes for each graph clutters the visualisation with alot of non-data ink.  Standardising the axes would not only fix clarity issues (mentioned in Section 1.1), but also allow the removal of the axes from some of the grids to reduce non-data ink which distracts from the actual visualisation.\r\nGrid is too small making it difficult to make out details in the data. Visualising the data individually for each country results in a very cramped grid which is difficult to read as each graph is too small.\r\nWasted white space below the color legend. The space in the visualisation is not utilised well. With the main visualisation already cramped, the space under the legend could have been better utilised by data ink.\r\n2. Proposed alternative visualisation\r\n2.1 Proposed narrative\r\nThe visualisation should inform the reader about Singapore’s merchandise trade based on the trading volume data. The user should be able to draw some key insights such as:\r\nWho are Singapore’s biggest trading partners?\r\nIs Singapore too dependent on a handful of countries?\r\nDoes Singapore import more than we export?\r\nThis narrative will help to give the reader an idea of Singapore’s merchandise trade dependecies.\r\n2.2 Sketch of alternative visualisation\r\nBased on the above narrative, it is proposed that the data be visualised as a “pyramid” chart, where:\r\nExport and Import volumes are visualised side by side on inverted axes. This will allow a reader to immediately see the total bilateral trade volume for a given country/region. It also informs the reader of the nature of the trading relationship with that country/region (e.g. surplus or deficit).\r\nThe data is sorted in descending order of total bilateral trade volume. This will allow the reader to immediately see which are our most important trading partners.\r\nData should be truncated to the top N trading relationships so that the visualisation does not get too cluttered. N should be a nice round number (e.g. 10, 20) to make for easy reading.\r\nAxes should be removed to reduce non-data ink. They are unnecessary anyway, as the relative differences in the trading volumes are well captured by the length of the bars. We can also add data labels for easy reading.\r\nImports are put on the left as people tend to associate the rightward direction with outgoing and the leftward direction with incoming. This helps to make the visualisation more intuitive.\r\nUse the same colors, but different shades, for imports and exports. This helps to reduce the number of different colours on the page and helps the reader to focus on the length of the bars which is the main focus of the visualisation.\r\nAdditional visualisation at the bottom shows how big a share of our merchandise trading volumes is dependent on the top N countries. This will help to give the reader a sense of our dependence on these relationships.\r\n\r\nSketch of proposed data visualisation\r\n3. Step-by-step guide on preparing data visualisation in Tableau\r\n3.1 Data preparation in Excel\r\nIn order to use the data in Tableau to generate the desired visualisation, we would first have to “unstack” the table and ensure that the date is stored as a dimension, rather than be used as a column name. This will allow Tableau to process the data as a time series.\r\n\r\nData transformation required\r\nThis data transformation can be done using Excel VBA. Be sure to pay attention to the data, as there might be some inconsistency that will impact the transformation. For example, “na” is usually used to denote missing data. However, from Jan 1998 to Dec 1998, trade data for imports from ‘Yemen Democratic’ was indicated by ‘-’. The macro below includes code breaks to help pick out such issues. In this case, simple replace all ‘-’ with ‘na’.\r\nYou may refer here for details on how to use VBA on Microsoft Excel. The site will show you how to access the script editor. I’ve also provided the script I used to process the data below. This script can be copied into the script editor and run to transform the data into the desired form.\r\nExample VBA script to perform data transformation:\r\n\r\n#VBA code to execute data processing\r\n\r\nSub unstack_table()\r\n\r\nDim data_range As Range\r\nDim data As String\r\n\r\nIf ActiveSheet.Name = \"T1\" Then\r\n    data = \"Imports\"\r\nElseIf ActiveSheet.Name = \"T2\" Then\r\n    data = \"Exports\"\r\nElse\r\n    GoTo err_break1\r\nEnd If\r\n\r\nSet data_range = Range(\"B8\", Range(\"B8\").End(xlDown).End(xlToRight))\r\n\r\nFor i = 1 To data_range.Rows.Count\r\n    For j = 1 To data_range.Columns.Count\r\n        If data_range.Cells(i, j) <> \"na\" Then\r\n            Sheets(data).Cells(1, 1).End(xlDown).Offset(1).Value = _\r\n              Trim(Split(data_range.Cells(i, 1).Offset(, -1).Text, \"(\")(0))\r\n            Sheets(data).Cells(1, 2).End(xlDown).Offset(1).Value = _\r\n              Split(data_range.Cells(1, j).Offset(-2).Text, \" \")(1) & \" \" & _\r\n              Split(data_range.Cells(1, j).Offset(-2).Text, \" \")(0)\r\n            If Split(data_range.Cells(i, 1).Offset(, -1).Text, \"(\")(1) = _\r\n              \"Thousand Dollars)\" Then\r\n                Sheets(data).Cells(1, 3).End(xlDown).Offset(1).Value = _\r\n                  data_range.Cells(i, j).Value * 1000\r\n            ElseIf Split(data_range.Cells(i, 1).Offset(, -1).Text, \"(\")(1) = _\r\n              \"Million Dollars)\" Then\r\n                Sheets(data).Cells(1, 3).End(xlDown).Offset(1).Value = _\r\n                data_range.Cells(i, j).Value * 1000000\r\n            Else\r\n                GoTo err_break2\r\n            End If\r\n        End If\r\n    Next j\r\nNext i\r\n\r\nGoTo endsub\r\n\r\nerr_break1:\r\n\r\nMsgBox \"Select either sheet T1 or T2 to run the macro\"\r\n\r\nGoTo endsub\r\n\r\nerr_break2:\r\n\r\nMsgBox \"Something is wrong with \" & data_range.Cells(i, 1).Offset(, -1).Text\r\n\r\nendsub:\r\n\r\nEnd Sub\r\n\r\nPerform this transformation on both the Import and Export data to generate two separate tables. Note that in the event of ‘na’, the data is not copied over, which will result in ‘null’ returns when the data is visualised in Tableau. This should be the correct interpretation for the missing data at this point, as we cannot assume that missing data means that there was no trade at all (which is indicated by a zero in the data).\r\n3.2 Visualisation in Tableau\r\nOnce the data has been prepared, we now move to Tableau to execute the proposed visualisation.\r\nStep\r\nActions Required\r\nScreenshot\r\n1\r\nFirst, load the processed data into Tableau and join the Import and Export tables. We should use a full outer join as there will be cases where a country has registered exports but no registered imports for the given time period and vice versa. Any other form of join (e.g. left outer, right outer, inner) will result in loss of data. The data should be joined on Country/Region and Date\r\n\r\n2\r\nNext, create calculated fields to consolidate the data for Country/Region and Date as these fields will be nil for some rows if we only look at Imports or Exports. We can do this using an IFNULL statement.\r\n\r\n3\r\nNow create a calculated field for the total bilateral trade (i.e. exports + imports). We will be using this value to rank the countries/regions later. Be sure to use IFNULL to convert nulls to zeroes as null + value will return a null. This will cause the later visualisation to be wrong as data will be missed.\r\n\r\n4\r\nCreate the centrepiece of the data visualisation, the ‘pyramid’ bar chart. We do this by dragging Imports and Exports into the columns and setting the visualisation to bar. Change the color of the Exports bars to differentiate them from the Imports bars by selecting Color on the Marks tab and editing the color for the Exports bar graph. Then we drag Country/Region into the rows so that the data is split by country/region. To achieve row banding for better visualisation, right-click Country/Region and select Format. Then select the Shading tab (i.e. the third tab) and choose a colour for Pane under Row Banding. Set the Banding Size to the second notch. Finally, we use the filters to filter the data by date to 2019-2020 which is the time range specified in the original visualisation.\r\n\r\n5\r\nRight-click the horizontal axis of Imports, which should be on the left side of the graph and reverse the axis so that the origin starts from the right instead of the left. This will create the “pyramid” look\r\n\r\n6\r\nWhile on the edit axis menu, select Tick Marks and set both major and minor tick marks to None. We don’t want to clutter out visualisation with non-data ink! Repeat this with the Export axis and then hide both axes by right-clicking and deselecting the Show Header option.\r\n\r\n7\r\nAdd data labels by dragging Imports and Exports to the respective Marks tab. Format the number by clicking on the right side of the green pill bar and selecting Format. Then select Pane and edit the number format in Number. We want to visualise the number in ‘billions’ to reduce the length of the numbers and reduce clutter in our visualisation.\r\n\r\n8\r\nRight-click the Country/Region headers on the left and click Format. Then adjust the fonts and size in the Header tab.\r\n\r\n9\r\nNow right-click the Country/Region pill bar under Rows and select Sort. We will now sort the data in the bar graphs by total bilateral trade volumes to identify our most important merchandise trade relationships.\r\n\r\n10\r\nNotice that interspersed among our biggest trade relationships are regions which are actually whole continents (e.g. Asia, America). These are aggregated data from the countries that belong in the respective continent or region (e.g. European Union). We will have to remove this data from the visualisation to avoid double counting. Drag the Country/Region dimension into the Filters tab and then right-click and Edit Filter. Uncheck the continents and regions.\r\n\r\n11\r\nNow we can see all out trading relationships between 2019-2020. We shall pick the top 20 relationships for the visualisation. Right-click the Country/Region filter and select the Top tab. Then select By field and specify the top 20 in Total Bilateral Trade. You are now done with the centrepiece graph!\r\n\r\n12\r\nTo create the bars showing the proportion of total trading volume contributed by the top 20 countries/regions, we will need to do so on a new worksheet. Create a new sheet by selecting the New Worksheet button at the the bottom.\r\n\r\n13\r\nDrag Imports to columns and select Bar as the type of mark. Perform the necessary filtering as described in Steps 4 and 10. In order to reuse this for the Exports chart, right-click the Country/Regions filter and click Create Set. You can call this set “Less Regions Set”\r\n\r\n14\r\nCreate a another set by right-clicking Country/Region under the Data tab on the left of the screen. Then select Create and Set. In this set, select the top 20 countries as identified from the visualisation generated in Steps 1 to 11.\r\n\r\n15\r\nNow drag this new set into the Marks tab and set it to color. Then click the Color button on the Marks tab and click Edit Colors…. Choose the colors for the IN and OUT. This specifies the colors for data within the top 20 countries set and outside the top 20 countries set. We will make them blue and gray for maximum contrast as shade is already used to distinguish between exports and imports.\r\n\r\n16\r\nWe will need the data labels to be informative as we want to reduce clutter and non-data ink. Therefore, we will need to create a calculated field that will label the top 20 countries data with “Top 20:” and not label anything on the data outside the set.\r\n\r\n17\r\nThen use Quick Table Calculation to create the Percent of Total to add to the data label.\r\n\r\n18\r\nPut it all together by using the Edit Label function in the Marks tab as shown.\r\n\r\n19\r\nRepeat this for Exports.\r\n\r\n20\r\nFinally, it is time to put everything together into our final visualisation. We will use a dashboard to do this, so create a dashboard by clicking the respective button at the bottom.\r\n\r\n21\r\nDrag the sheets onto the page and arrange them in a neat order. Use the Blank objects for spacers as needed and the Text objects to input text into your visualisations.\r\n\r\n22\r\nUse the Layout tab to provide background color for your text objects as needed.\r\n\r\nAnd now you’re done!\r\n4. New Visualisation and Observations\r\nExecuting the visualisation described in Section 2, we produce the following graphic. The workbook can also be accessed on Tableau Public here.\r\n\r\nNew data visualisation\r\nFrom the visualisation, we can make the following observations:\r\nIt becomes immediately apparent that the original visualisation was incorrect in identifying Singapore’s top 6 merchandise trade relationships. It should be Indonesia and not Japan which is included in the top 6.\r\nWe have a diverse and global set of trading partners, with four continents represented amongst our top 20 merchandise trading relationships.\r\nOur top 5 trade relationships account for nearly half of our merchandise trade by volume, and our top 20 account for about 90% of our merchandise trade. This shows that while we are fairly well diversified geographically speaking, Singapore is still quite dependent on a handful of major trading partners.\r\nWe are a net exporter. We export about 10% more merchandise (by value) than we import, which indicates that we run a trade surplus with regards to merchandise. Some of our trade relationships feature a significant trade imbalance (e.g. trade with Hong kong runs a signficant surplus, while trade with Taiwan runs a significant deficit). This information, along with information types of merchandise exported, services trade data, etc. are important to inform our exchange rate policy, which has significant impacts on our trade.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T17:23:54+08:00",
    "input_file": "my-1st-post.knit.md"
  }
]
